{
  "_name_or_path": "roberta-base",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACTOR",
    "1": "B-CHARACTER",
    "2": "B-DIRECTOR",
    "3": "B-GENRE",
    "4": "B-PLOT",
    "5": "B-RATING",
    "6": "B-RATINGS_AVERAGE",
    "7": "B-REVIEW",
    "8": "B-SONG",
    "9": "B-TITLE",
    "10": "B-TRAILER",
    "11": "B-YEAR",
    "12": "I-ACTOR",
    "13": "I-CHARACTER",
    "14": "I-DIRECTOR",
    "15": "I-GENRE",
    "16": "I-PLOT",
    "17": "I-RATING",
    "18": "I-RATINGS_AVERAGE",
    "19": "I-REVIEW",
    "20": "I-SONG",
    "21": "I-TITLE",
    "22": "I-TRAILER",
    "23": "I-YEAR",
    "24": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACTOR": 0,
    "B-CHARACTER": 1,
    "B-DIRECTOR": 2,
    "B-GENRE": 3,
    "B-PLOT": 4,
    "B-RATING": 5,
    "B-RATINGS_AVERAGE": 6,
    "B-REVIEW": 7,
    "B-SONG": 8,
    "B-TITLE": 9,
    "B-TRAILER": 10,
    "B-YEAR": 11,
    "I-ACTOR": 12,
    "I-CHARACTER": 13,
    "I-DIRECTOR": 14,
    "I-GENRE": 15,
    "I-PLOT": 16,
    "I-RATING": 17,
    "I-RATINGS_AVERAGE": 18,
    "I-REVIEW": 19,
    "I-SONG": 20,
    "I-TITLE": 21,
    "I-TRAILER": 22,
    "I-YEAR": 23,
    "O": 24
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
